<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Mono Framework and imports it into Munki

Default MONOPATTERN (https.*x86.pkg) downloads 32 bit version of framework.
For universal 32bit/64bit build use MONOPATTERN (https.*universal.pkg)
</string>
    <key>Identifier</key>
    <string>com.github.michalmmac.munki.MonoFramework</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MonoFramework</string>
        <key>MONOPATTERN</key>
        <string>(https.*.pkg)</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/developer/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Sponsored by Xamarin, Mono is an open source implementation of Microsoft's .NET Framework based on the ECMA standards for C# and the Common Language Runtime.</string>
            <key>category</key>
            <string>Developer</string>
            <key>developer</key>
            <string>Mono Project</string>
            <key>display_name</key>
            <string>Mono Framework MDK</string>
            <key>name</key>
            <string>%NAME%</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.michalmmac.download.MonoFramework</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
