<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of MonoFramework and installs it.</string>
    <key>Identifier</key>
    <string>com.github.michalmmac.install.MonoFramework</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MonoFramework</string>
        <key>MONOPATTERN</key>
        <string>(https.*.pkg)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>ParentRecipe</key>
    <string>com.github.michalmmac.download.MonoFramework</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe is deprecated. Please use Mono recipes from orchard-recipes instead.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
