<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of MacGameStore.

MGSURL can be changed to download legacy MacGameStore builds.
- MGSCore5 is dir with current version of MGS application (10.6+)
- MGSCore4 is dir with EOL version of MGS application (10.5+)
- MGSCore3 is dir with EOL version of MGS application (10.4+)
- MGSCore6 is going to be future directory for new MGS application (10.7+)      
</string>
    <key>Identifier</key>
    <string>com.github.michalmmac.download.MacGameStore</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MacGameStore</string>
        <key>MGSURL</key>
        <string>https://www.macgamestore.com/downloader/MGSCore5/MacGameStore.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%MGSURL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/MacGameStore.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.macgamestore.Client2" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = R94YUU7543)</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
