<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of MacGameStore and installs it</string>
    <key>Identifier</key>
    <string>com.github.michalmmac.install.MacGameStore</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MacGameStore</string>
        <key>MGSURL</key>
        <string>https://www.macgamestore.com/downloader/MGSCore5/MacGameStore.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.michalmmac.download.MacGameStore</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>InstallFromDMG</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
                <key>items_to_copy</key>
                <array>
                    <dict>
                        <key>source_item</key>
                        <string>MacGameStore.app</string> 
                        <key>destination_path</key>
                        <string>/Applications</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>admin</string>               
                    </dict>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
