<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of FlexiBee client and imports it into Munki.

FlexiBee requires Java environment to run.
</string>
    <key>Identifier</key>
    <string>com.github.michalmmac.munki.FlexiBeeClient</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FlexiBeeClient</string>
        <key>BEEURL</key>
        <string>https://www.flexibee.eu/podpora/stazeni-flexibee/</string>
        <key>BEEPATTERN</key>
        <string>https://.*FlexiBee-client.*dmg</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/productivity/FlexiBee</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Účetnictví pro menší firmy a živnostníky. Odkudkoliv, kdykoliv pro Windows, Linux a Mac.</string>
            <key>category</key>
            <string>Productivity</string>
            <key>developer</key>
            <string>ABRA Flexi s.r.o.</string>
            <key>display_name</key>
            <string>FlexiBee client</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.michalmmac.download.FlexiBeeClient</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
