 <?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of GameRanger and imports it into Munki</string>
    <key>Identifier</key>
    <string>com.github.michalmmac.munki.GameRanger</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GameRanger</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/games/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>GameRanger is a free download for Mac and PC that lets you play over 600 games and demos online with friends and opponents worldwide. GameRanger offers features like profiles, friends lists, instant messaging, in-game voice communication, and competitive ladders/rankings/ratings.</string>
            <key>category</key>
            <string>Games</string>
            <key>developer</key>
            <string>GameRanger Technologies</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.michalmmac.download.GameRanger</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
