<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Mira and imports it into Munki.

Munki recipe specifies `RequireRestart` pkginfo key because of multiple launchd items (un)loaded by package scripts in user context.
Package preinstall and postinstall scripts do a lot of neat things in user's Library. For example thex disable Plex helper. Installing by Munki or AutoPkg prevents them from doing so. Inspect both scripts before deploying.
</string>
    <key>Identifier</key>
    <string>com.github.michalmmac.munki.Mira</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Mira</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/utilities/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Enables you to configure Apple remote behavior. Mira drops into your System Preferences and provides an easy interface to change button settings for all your applications. It even supports 12 different languages.</string>
            <key>category</key>
            <string>Utilities</string>
            <key>developer</key>
            <string>Twisted Melon Inc.</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>RestartAction</key>
            <string>RequireRestart</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.michalmmac.download.Mira</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
