<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Mira disk image and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.michalmmac.munki.Mira</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Mira</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/utilities/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>With mira, you can free yourself from the keyboard to streamline your activities. Get work done faster and easier, or enjoy convenience while relaxing with a movie. Uses for the Apple Remote are limited only by your imagination.</string>
            <key>category</key>
            <string>Utilities</string>
            <key>developer</key>
            <string>Twisted Melon Inc.</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.michalmmac.download.Mira</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
