<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Binance</string>
    <key>Identifier</key>
    <string>com.github.michalmmac.download.Binance</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Binance</string>
        <key>BINANCE_URL</key>
        <string>https://ftp.binance.com/electron-desktop/mac/production/binance.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%BINANCE_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
          <key>Processor</key>
          <string>CodeSignatureVerifier</string>
          <key>Arguments</key>
          <dict>
              <key>input_path</key>
              <string>%pathname%/Binance.app</string>
              <key>requirement</key>
              <string>identifier "com.binance.BinanceDesktop" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "89H83DPVB8"</string>
          </dict>
        </dict>
    </array>
</dict>
</plist>
