<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Binance and creates a package</string>
    <key>Identifier</key>
    <string>com.github.michalmmac.pkg.Binance</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Binance</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.michalmmac.download.Binance</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%pathname%/Binance.app</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
