<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>LangPack</string>
	<key>Identifier</key>
	<string>LangPack.download.recipe</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LibreOffice</string>
		<key>TYPE</key>
		<string>mac-x86_64</string>
		<key>LANGUAGE_CODE</key>
		<string>cs</string>
	</dict>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.LibreOffice</string>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
	  <dict>
			<key>Processor</key>
			<string>StoreVariable</string>
			<key>Arguments</key>
			<dict>
				<key>variable_content</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>LibreOfficeLanguagePackURLProvider</string>
			<key>Arguments</key>
			<dict>
				<key>type</key>
				<string>%TYPE%</string>
				<key>language_code</key>
				<string>%LANGUAGE_CODE%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
