 <?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of CuteClips3 and imports it into Munki</string>
    <key>Identifier</key>
    <string>com.github.michalmmac.munki.CuteClips3</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CuteClips3</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/utilities/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>CuteClips3 is the brand new release of DoubleDog Software's great clipboard history. Focusing on simplicity, CuteClips 3 is the perfect history for everybody's clipboard. CuteClips 3 sits in the background and records changes to the clipboard. It keeps the last 12 clips, providing a big preview for all copied items</string>
            <key>category</key>
            <string>Utilities</string>
            <key>developer</key>
            <string>CuteClips3</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.michalmmac.download.CuteClips3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
