 <?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of inSSIDer and imports it into Munki</string>
    <key>Identifier</key>
    <string>com.github.michalmmac.munki.inSSIDer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>inSSIDer</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/admin/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>inSSIDer is Wi‑Fi optimization and troubleshooting software that takes Wi‑Fi network discovery to a whole new level. With a quick glance, you'll be able to find poor channel placement, low signal strength, and RF interference in the 2.4 and 5 GHz bands.</string>
            <key>category</key>
            <string>Admin</string>
            <key>developer</key>
            <string>MetaGeek, LLC</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.michalmmac.download.inSSIDer</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
