<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current x86_64 release version of draw.io
for arm change %PLATFORM_ARCH% AND %SUPPORTED_ARCH% to arm64</string>
    <key>Identifier</key>
    <string>com.github.michalmmac.download.draw.io</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>draw.io</string>
        <key>PLATFORM_ARCH</key>
        <string>x64</string>
        <key>SUPPORTED_ARCH</key>
        <string>x86_64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Consider switching to the draw.io recipes in the peshay-recipes repo. This recipe is deprecated and will be removed in the future.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>jgraph/drawio-desktop</string>
                <key>asset_regex</key>
                <string>.*%PLATFORM_ARCH%.*\.dmg$</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/draw.io.app</string>
                <key>requirement</key>
                <string>identifier "com.jgraph.drawio.desktop" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UZEUFB4N53</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
