<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of draw.io creates a package and installs it</string>
    <key>Identifier</key>
    <string>com.github.michalmmac.install.draw.io</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>draw.io</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.michalmmac.download.draw.io</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>InstallFromDMG</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
                <key>items_to_copy</key>
                <array>
                    <dict>
                        <key>source_item</key>
                        <string>draw.io.app</string>
                        <key>destination_path</key>
                        <string>/Applications</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>admin</string>
                    </dict>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
