<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of draw.io creates a package and imports it into Munki</string>
    <key>Identifier</key>
    <string>com.github.michalmmac.munki.draw.io</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>draw.io</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/productivity/%NAME%_%PLATFORM_ARCH%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>diagrams.net is open source, online, desktop and container deployable diagramming software</string>
            <key>category</key>
            <string>Productivity</string>
            <key>developer</key>
            <string>diagrams.net</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%_%PLATFORM_ARCH%</string>
            <key>minimum_os_version</key>
            <string>10.7.0</string>
            <key>blocking_applications</key>
            <array>
                <string>draw.io</string>
            </array>
            <key>unattended_install</key>
            <true/>
	    <key>supported_architectures</key> 
	    <array> 
	        <string>%SUPPORTED_ARCH%</string> 
	    </array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.michalmmac.download.draw.io</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
