<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Latexian creates a package and installs it.

Latexian has reached EOL (See http://tacosw.com/index.php). Download link might become broken in near future.
Latexian requires MacTeX (See http://www.tug.org/mactex/).
</string>
    <key>Identifier</key>
    <string>com.github.michalmmac.install.Latexian</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Latexian</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.michalmmac.pkg.Latexian</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
